; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	image0 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	Star4 - direction
	Star1 - direction
	GroundStation0 - direction
	Star5 - direction
	GroundStation2 - direction
	Star3 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 image0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star5)
	(supports instrument2 spectrograph1)
	(supports instrument2 image0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite1 Phenomenon11)
	(have_image Planet6 spectrograph2)
	(have_image Star7 spectrograph1)
	(have_image Star8 spectrograph2)
	(have_image Phenomenon9 image0)
	(have_image Star10 image0)
	(have_image Phenomenon11 spectrograph1)
	(have_image Star12 image0)
	(have_image Planet13 image0)
	(have_image Planet14 spectrograph1)
))

)

; plan
1. (turn_to satellite1 groundstation2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 11
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 11
3. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 11
4. (turn_to satellite1 planet13 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet13)
   goals met: 0 of 11
5. (take_image satellite1 planet13 instrument2 image0)
   added: (have_image planet13 image0)
   goals met: 1 of 11
6. (turn_to satellite1 phenomenon9 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 11
7. (turn_to satellite0 star8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star8)
   goals met: 2 of 11
8. (take_image satellite1 phenomenon9 instrument2 image0)
   added: (have_image phenomenon9 image0)
   goals met: 3 of 11
9. (turn_to satellite1 planet14 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet14)
   goals met: 3 of 11
10. (take_image satellite1 planet14 instrument2 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 4 of 11
11. (turn_to satellite1 planet6 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet6)
   goals met: 4 of 11
12. (take_image satellite1 planet6 instrument2 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 5 of 11
13. (turn_to satellite1 star10 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star10)
   goals met: 5 of 11
14. (take_image satellite1 star10 instrument2 image0)
   added: (have_image star10 image0)
   goals met: 6 of 11
15. (turn_to satellite1 star12 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star12)
   goals met: 6 of 11
16. (take_image satellite1 star12 instrument2 image0)
   added: (have_image star12 image0)
   goals met: 7 of 11
17. (turn_to satellite1 star7 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star7)
   goals met: 7 of 11
18. (take_image satellite1 star7 instrument2 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 8 of 11
19. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 8 of 11
20. (take_image satellite1 star8 instrument2 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 9 of 11
21. (turn_to satellite1 phenomenon11 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon11)
   goals met: 10 of 11
22. (take_image satellite1 phenomenon11 instrument2 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 11 of 11
